app/controllers/locations_controller.rb

  def index
    @locations = Location.all
---
SELECT "locations".* FROM "locations"

  def create
    @location = Location.new(location_params)

    if @location.save
---
INSERT INTO "locations" ("lat", "lng", "location_name", "user_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6) RETURNING "id"  [["lat", 24], ["lng", 54], ["location_name", "Abu Dhabi - United Arab Emirates"], ["user_id", 2], ["created_at", "2017-10-13 19:25:24.276434"], ["updated_at", "2017-10-13 19:25:24.276434"]]